Функция: Добавить элемент в список

@позитивный
Сценарий: Добавить элемент в голову списка
	Допустим я инициализирую список
	И добавляю в него элементы
	Когда я добавляю элемент в голову списка
	Тогда в голове списка будет добавленный элемент

@позитивный
Сценарий: Добавить элемент в хвост списка
	Допустим я инициализирую список
	И добавляю в него элементы
	Когда я добавляю элемент в хвост списка
	Тогда в хвосте списка будет добавленный элемент

@позитивный
Сценарий: Добавить элемент после заданного узла
	Допустим я инициализирую список
	И добавляю в него элементы
	Когда я добавляю элемент в список после заданного узла
	Тогда после зданного узла будет добавленный элемент
